{
    "experiments": [
        {
            "image": "public/experiments/LLM_1.webp",
            "title": "Childlike minimalist digital illustration",
            "text": "<p>I tested ChatGPT to draw a face : a young bald face in particular. It can generate an SVG file. The artwork evokes a childlike innocence, reminiscent of <a href='https://en.wikipedia.org/wiki/Paul_Klee'>Paul Klee</a> with its bold shapes and playful expression. The soft color palette contributes to a cheerful yet contemplative mood, highlighting the beauty of simplicity in design.</p><p>Prompt:<br>Generate the SVG-Code of an image of a young bald man</p>"
        },
        {
            "image": "public/experiments/LLM_2.webp",
            "title": "Lighthearted minimalist design",
            "text": "<p>I did the same with Llama 2, an opensource LLM. While it was not able to depict the prompt, the overall design feels lighthearted due to its simplicity and bold lines, creating a cheerful abstract ambiance that invites joy and curiosity.</p><p>Prompt:<br>Generate the SVG-Code of an image of a young bald man</p>"
        },
        {
            "image": "public/experiments/LLM_3.webp",
            "title": "Minimalism with bold forms",
            "text": "<p>In this piece, I explored minimalistic forms and bold colors to convey a playful yet slightly unsettling expression. The LLM I used was gpt35-turbo-16k, an older version of the ChatGPT-familiy. The simplified facial features evoke the style of <a href='https://en.wikipedia.org/wiki/Roy_Lichtenstein'>Roy Lichtenstein</a>, while the overall mood resonates with the works of contemporary artists like <a href='https://en.wikipedia.org/wiki/Yayoi_Kusama'>Yayoi Kusama</a>. The stark contrast and clean lines create a tension that draws the viewer in.</p><p>Prompt:<br>Generate the SVG-Code of an image of a young bald man</p>"
        },
        {
            "image": "public/experiments/LLM_4.webp",
            "title": "Simplistic line drawing inspired by Picasso",
            "text": "<p>The LLM of you.com can do the task, too – but adds some artefacts, which make the image interesting. The composition echoes the works of <a href='https://en.wikipedia.org/wiki/Pablo_Picasso'>Pablo Picasso</a>, creating an abstract mood through its playful design. </p><p>Prompt:<br>Generate the SVG-Code of an image of a young bald man</p>"
        },
        {
            "image": "public/experiments/LLM+img2img_1.webp",
            "title": "Surreal Hyperrealism Exploration",
            "text": "<p>I experimented with Img2img and use the outputs of the LLMs as an image input. In this piece, I explored the realms of surrealism and hyperrealism, utilizing 3D modeling techniques. The mood is unsettling, conveying themes of identity and perception through its minimalist composition.</p><p>Prompt: <br>A portrait photo of a young bald man, big round heavy face<br>Negative prompt: cartoon, illustration, comic<br>Steps: 20, Sampler: PLMS, CFG scale: 7, Seed: 1, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, Denoising strength: 0.8, VAE Encoder: TAESD, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/LLM+img2img_2.webp",
            "title": "Surreal digital manipulation art",
            "text": "<p>I delved into surrealism and digital manipulation here. The img2img technique was employed as well. The image evokes a sense of eeriness reminiscent of <a href='https://en.wikipedia.org/wiki/Jeff_Koons'>Jeff Koons</a>' work, featuring an unsettlingly calm expression. The soft color palette adds to the dreamlike atmosphere, creating an introspective mood that invites viewers to explore themes of identity and perception.</p><p>Prompt: <br>A portrait photo of a young bald man, big round heavy face<br>Negative prompt: cartoon, illustration, comic<br>Steps: 20, Sampler: PLMS, CFG scale: 7, Seed: 1, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, Denoising strength: 0.8, VAE Encoder: TAESD, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/LLM+img2img_3.webp",
            "title": "Surreal exploration of identity",
            "text": "<p>In this piece, I explored the themes of identity and perception through digital manipulation and surrealism. The abstract features challenge traditional representation, inviting viewers to ponder the complexities of self-image in a modern context.</p><p>Prompt: <br>A portrait photo of a young bald man, big round heavy face<br>Negative prompt: cartoon, illustration, comic<br>Steps: 20, Sampler: PLMS, CFG scale: 7, Seed: 1, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, Denoising strength: 0.8, VAE Encoder: TAESD, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/LLM+img2img_4.webp",
            "title": "Clay Surrealism",
            "text": "<p>Img2img also played a role in this image. In this piece, I explored a blend of minimalism and surrealism through digital mediums. The central figure evokes a sense of curiosity and detachment. The AI interpreted the image input of the LLM almost as clay and evokes an eerie unnatural look.</p><p>Prompt: <br>A portrait photo of a young bald man, big round heavy face<br>Negative prompt: cartoon, illustration, comic<br>Steps: 20, Sampler: PLMS, CFG scale: 7, Seed: 1, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, Denoising strength: 0.8, VAE Encoder: TAESD, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/Loop_Photomaker1.webp",
            "title": "Exaggerated features",
            "text": "<p>For this experiment I employed an faceswap but always used the output as input again. After looping for around 160 loops, the original image got distorted and a exaggerated caricature. In this work, I delved into surrealism with exaggerated facial features, exploring the concept of emotion through distortion. The image echoes the style of <a href='https://en.wikipedia.org/wiki/Francis_Bacon_(artist)'>Francis Bacon</a>, presenting a tense atmosphere due to its stark contrasts and unsettling expression. The muted palette enhances the overall sense of discomfort and intrigue.</p><p>Prompt:<br>three quarter portrait of a young bald man img, black t-shirt, white background</p><p>I used <a href='https://colab.research.google.com/github/camenduru/PhotoMaker-colab/blob/main/PhotoMaker_colab.ipynb'>Photomakers Colab</a> for this experiment</p>"
        },
        {
            "image": "public/experiments/Loop_Photomaker_2.webp",
            "title": "Surreal pop art character",
            "text": "<p>To test this experiment furter I took an image of Donald Trump and let it run for about 150 loops. In this piece, I explored a blend of surrealism and pop art, capturing an exaggerated character that evokes a sense of humor and irony. </p><p>Prompt:<br>three quarter portrait of a blonde politician img, blue suit, red tie, white background</p><p>I used <a href='https://colab.research.google.com/github/camenduru/PhotoMaker-colab/blob/main/PhotoMaker_colab.ipynb'>Photomakers Colab</a> for this experiment</p>"
        },
        {
            "image": "public/experiments/Loop_Photomaker_3.webp",
            "title": "Introspective portrait with surrealism",
            "text": "<p>In another attempt I used an image of Taylor Swift to experiment with. The human figure's expression conveys both vulnerability and strength, reminiscent of <a href='https://en.wikipedia.org/wiki/Lucian_Freud'>Lucian Freud</a>. The mood is introspective, enhanced by the subtle color palette and direct gaze, creating a sense of cold intimacy.</p><p>Prompt:<br>three quarter portrait of a young blonde singer img, black t-shirt, white background</p><p>I used <a href='https://colab.research.google.com/github/camenduru/PhotoMaker-colab/blob/main/PhotoMaker_colab.ipynb'>Photomakers Colab</a> for this experiment</p>"
        },
        {
            "image": "public/experiments/Loop_io.webp",
            "title": "Digital surrealism with introspective atmosphere",
            "text": "<p>In this piece, I explored digital distortion and surrealism. The imagery evokes <a href='https://en.wikipedia.org/wiki/David_Hockney'>David Hockney</a> with its fragmented, layered forms, creating an introspective atmosphere. The cool color palette and geometric patterns contribute to a contemplative mood, inviting viewers to ponder identity and perception.</p><p>First I got an image description via ChatGPT and used this to generate an Image. Then I used different CFG scales and used img2img to generate a new image. I looped this workflow a couple of times to get an more abstract image over time.</p>"
        },
        {
            "image": "public/experiments/Negative_Prompt.webp",
            "title": "Abstract Exploration of Negative Space",
            "text": "<p>In this artwork, I explored the interplay of negative space and abstraction. The stark contrast of the hands suggests a sense of urgency and motion. This piece resonates with the style of <a href='https://en.wikipedia.org/wiki/Hans_Hartung'>Hans Hartung</a>, evoking a dynamic tension through its bold forms and monochromatic palette, creating an atmosphere of introspection and intrigue.</p><p>I switched what is normally employed as a negative prompt with the postive prompt:<br>deformed, bad anatomy, disfigured, mutated, extra limb, ugly, poorly drawn hands, missing limb, floating limbs, disconnected limbs, disconnected head, malformed hands, long neck, mutated hands and fingers, bad hands, missing fingers, cropped, worst quality, low quality, mutation, poorly drawn, huge calf, bad hands, fused hand, missing hand, disappearing arms, disappearing thigh, disappearing calf, disappearing legs, missing fingers, fused fingers, abnormal eye proportion, Abnormal hands, abnormal legs, abnormal feet, abnormal fingers</p>"
        },
        {
            "image": "public/experiments/Stylemix.webp",
            "title": "Realistic abstraction with mood",
            "text": "<p>In this piece, I explored a blend of realism and subtle abstraction through soft brushwork and muted colors. The image evokes a contemplative mood, reminiscent of the works of <a href='https://en.wikipedia.org/wiki/Lucian_Freud'>Lucian Freud</a>, yet carries a modern touch akin to contemporary artists like <a href='https://en.wikipedia.org/wiki/Marina_Abromovic'>Marina Abramović</a>. The composition draws viewers into an intimate connection.</p><p>Prompt: <br>vector illustration, charcoal illustration, oil painting, cyanotype, watercolor painting, a young bald man in a black tshirt<br>teps: 20, Sampler: DPM++ 2M Karras, CFG scale: 29, Seed: 243924184, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/cfgscale_1.webp",
            "title": "Dynamic, playful geometric art",
            "text": "<p>In this piece, I explored a vibrant mix of geometric shapes and bold colors, creating a sense of playfulness and whimsy. The overall vibe is reminiscent of <a href='https://en.wikipedia.org/wiki/Frank_Stella'>Frank Stella</a> and reflects an energetic mood due to the dynamic composition and interplay of forms. The layering evokes a sense of depth and curiosity.</p><p>Prompt: <br>A portrait photo of a young bald man, black t-shirt, looking into the camera, shaved, white background, studio photography<br>Steps: 20, Sampler: Euler A Turbo, CFG scale: -25.675675675675674, Seed: 2243401848, Size: 600x800, Model hash: 8a3086d0c0, Model: humans_v10, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/cfgscale_2.webp",
            "title": "Whimsical, Colorful Collage Art",
            "text": "<p>In this piece, I explored a playful and vibrant use of color through a collage of shapes and forms. The arrangement evokes the spirit of <a href='https://en.wikipedia.org/wiki/Paul_Klee'>Paul Klee</a>, imparting a sense of whimsy and joy. The composition feels lively due to the bold colors and dynamic layout, creating an overall atmosphere of excitement and curiosity.</p><p>Prompt: <br>A portrait photo of a young bald man, black t-shirt, looking into the camera, shaved, white background, studio photography<br>Steps: 20, Sampler: Euler A Turbo, CFG scale: -23.648648648648646, Seed: 2243401848, Size: 600x800, Model hash: 8a3086d0c0, Model: humans_v10, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/cfgscale_3.webp",
            "title": "Dreamlike Surreal Aesthetic",
            "text": "<p>I explored a dreamlike aesthetic through soft focus and ethereal colors in this piece. The imagery evokes a sense of innocence and wonder, reminiscent of <a href='https://en.wikipedia.org/wiki/Frida_Kahlo'>Frida Kahlo</a> and has a surreal atmosphere due to the misty backdrop and delicate textures. The overall composition conveys a mysterious mood, inviting introspection.</p><p>Prompt: <br>A portrait photo of a young bald man, black t-shirt, looking into the camera, shaved, white background, studio photography<br>Steps: 20, Sampler: Euler A Turbo, CFG scale: 0, Seed: 2243401848, Size: 600x800, Model hash: 8a3086d0c0, Model: humans_v10, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/cfgscale_4.webp",
            "title": "Digital Light and Shadow",
            "text": "<p>In this piece, I explored the interplay of light and shadow using a digital technique to create a futuristic feel. The bold colors reflect influence from <a href='https://en.wikipedia.org/wiki/Damien_Hirst'>Damien Hirst</a> and evoke a mood of tension and contemplation. The composition draws the viewer in, inviting reflection on identity and technology.</p><p>Prompt: <br>A portrait photo of a young bald man, black t-shirt, looking into the camera, shaved, white background, studio photography<br>Steps: 20, Sampler: Euler A Turbo, CFG scale: 77.70270270270271, Seed: 2243401848, Size: 600x800, Model hash: 8a3086d0c0, Model: humans_v10, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/cfgscale_5.webp",
            "title": "Modern digital glitch art",
            "text": "<p>I experimented here with bold colors and digital fragmentation. The image evokes the intense emotional depth found in the works of <a href='https://en.wikipedia.org/wiki/Vincent_van_Gogh'>Vincent van Gogh</a>, combined with a modern twist reminiscent of artists like <a href='https://en.wikipedia.org/wiki/Chuck_Closer'>Chuck Close</a>. The mood is striking and introspective, due to the contrasting hues and intricate detail in the composition.</p><p>Prompt: <br>A portrait photo of a young bald man, black t-shirt, looking into the camera, shaved, white background, studio photography<br>Steps: 20, Sampler: Euler A Turbo, CFG scale: 97.972972972973, Seed: 2243401848, Size: 600x800, Model hash: 8a3086d0c0, Model: humans_v10, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/collage_BarbaraKruger.webp",
            "title": "Minimalist design evoking introspection",
            "text": "<p>I explored minimalist design here, using stark contrasts and bold typography. This piece evokes the conceptual approach of <a href='https://en.wikipedia.org/wiki/Damien_Hirst'>Damien Hirst</a>, and carries an introspective mood due to its simplicity and striking message. The overall composition challenges viewers to reflect on identity and existence, blending visual rhetoric with personal engagement.</p><p>For this experiment I took an image of collage artist Barbara Kruger and reprompted elements just to collage them together via Photoshop.</p>"
        },
        {
            "image": "public/experiments/collage_HannahHoech.webp",
            "title": "Surreal digital art exploration",
            "text": "<p>In this piece, I delved into surrealism and digital manipulation. The figure’s elongated form and exaggerated features bring to mind the works of <a href='https://en.wikipedia.org/wiki/Salvador_Dal%C3%AD'>Salvador Dalí</a>, evoking a dreamlike quality. The contrasting warm red background creates a whimsical yet unsettling mood, highlighting the fusion of the bizarre and the beautiful.</p><p>For this experiment I took an image of collage artist Hannah Hoech and reprompted elements just to collage them together via Photoshop.</p>"
        },
        {
            "image": "public/experiments/collage_JoeWebb.webp",
            "title": "Surreal cosmic beachscape",
            "text": "<p>In this piece, I delve into a blend of surrealism and cosmic themes, utilizing digital techniques to create a dreamlike landscape. The figure walking on the beach juxtaposed with a vibrant planetary backdrop echoes the works of <a href='https://en.wikipedia.org/wiki/Paul_Gauguin'>Paul Gauguin</a>. The mood is contemplative, fostered by the soft colors and expansive space that evokes a sense of wonder.</p><p>For this experiment I took an image of collage artist Joe Webb and reprompted elements just to collage them together via Photoshop.</p>"
        },
        {
            "image": "public/experiments/collage_PeterHorvath.webp",
            "title": "Surrealist digital collage artwork",
            "text": "<p>I explored surrealism and digital collage in this piece. The imagery evokes the style of <a href='https://en.wikipedia.org/wiki/Salvador_Dali'>Salvador Dalí</a> with its fusion of reality and imagination. The mood is contemplative due to the soft color palette and structure, highlighting the relationship between human thought and the cosmos. This creates an introspective atmosphere, inviting viewers to ponder their own universe.</p><p>For this experiment I took an image of collage artist Peter Horvath and reprompted elements just to collage them together via Photoshop.</p>"
        },
        {
            "image": "public/experiments/controlnet_1.webp",
            "title": "Surrealistic digital introspection",
            "text": "<p>I explored the realm of surrealism combined with digital manipulation in this piece. The distortion of the face evokes a sense of introspection, akin to the works of <a href='https://en.wikipedia.org/wiki/Saul_Steinberg'>Saul Steinberg</a> but with a more contemporary twist. The color palette and soft focus give it a dreamlike quality, creating a feeling of vulnerability and contemplation.</p><p>Prompt: <br>A portrait photo of a young bald man, white background,studio photography,looking into the camera, black t-shirt<br>Steps: 20, Sampler: Euler, CFG scale: 8, Seed: 2023034553, Size: 512x768, Model hash: 51f6fff508, Model: analogDiffusion_10Safetensors, ControlNet 0: Module: None, Model: control_v11p_sd15_openpose [cab727d4], Weight: 1.5, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 1, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/controlnet_2.webp",
            "title": "Digital surrealism",
            "text": "<p>I explored surrealism through digital manipulation in this piece. The distorted features evoke a sense of alienation and introspection, reminiscent of <a href='https://en.wikipedia.org/wiki/Frida_Kahlo'>Frida Kahlo</a>’s exploration of identity. The muted palette and unusual composition create an unsettling mood, drawing viewers to confront their perceptions of self and reality.</p><p>Prompt: <br>A portrait photo of a young bald man, white background,studio photography,looking into the camera, black t-shirt<br>Steps: 20, Sampler: Euler, CFG scale: 8, Seed: 2023034553, Size: 512x768, Model hash: 51f6fff508, Model: analogDiffusion_10Safetensors, ControlNet 0: Module: None, Model: control_v11p_sd15_openpose [cab727d4], Weight: 1.5, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 1, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/controlnet_3.webp",
            "title": "Deformation of human form",
            "text": "<p>I'm fascinated by the interplay of the human form and surrealism in this piece. I explored dynamic poses and sculptural qualities reminiscent of <a href='https://en.wikipedia.org/wiki/Alberto_Giacometti'>Alberto Giacometti</a>. The mood is introspective, enhanced by the stark contrast and subtle textures that amplify the subject's contorted elegance. It evokes a sense of fluidity and tension, drawing the viewer into a dialogue with the body.</p><p>Prompt: <br>A portrait photo of a young bald man, white background,studio photography,looking into the camera, black t-shirt<br>Steps: 20, Sampler: Euler, CFG scale: 8, Seed: 2023034553, Size: 512x768, Model hash: 51f6fff508, Model: analogDiffusion_10Safetensors, ControlNet 0: Module: None, Model: control_v11p_sd15_openpose [cab727d4], Weight: 1.5, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 1, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/inpaint_dog.webp",
            "title": "Surreal human-animal hybrid art",
            "text": "<p>I explored the surreal by merging human and animal features via Inpainting, creating a whimsical yet striking juxtaposition. This piece reminds me of <a href='https://en.wikipedia.org/wiki/Frida_Kahlo'>Frida Kahlo</a> with its bold composition and unique character. The soft colors evoke a playful mood, enhanced by the subject's expressive eyes and textured fur, inviting curiosity and engagement.</p><p>Prompt: <br>breathtaking portrait of Bichpoo, white background, studio photography, sharp focus, intricate detail intricate eyes, wearing black tshirt, masterpiece, award-winning, professional, highly detailed<br>Negative prompt: ugly, deformed, noisy, blurry, distorted, grainy<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 3169902126, Size: 512x768, Model hash: f0d4872d24, Model: realisticVisionV51_v51VAE-inpainting, Denoising strength: 0.99, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/ip_adapter_style_1.webp",
            "title": "Eerie surrealism with abstraction",
            "text": "<p>In this piece, I explored surrealism with a focus on abstraction. The forms evoke the works of <a href='https://en.wikipedia.org/wiki/Alberto_Giacometti'>Alberto Giacometti</a>, creating an unsettling atmosphere through distorted figures. The muted colors and fragmented shapes contribute to a sense of alienation, inviting viewers to ponder identity and perception. The overall feeling is both eerie and thought-provoking.</p><p>I used the IP-Style-Adapter with an abstract image from an negative prompt experiment to use as an reference.</p>"
        },
        {
            "image": "public/experiments/ip_adapter_style_2.webp",
            "title": "Cosmic surreal digital art",
            "text": "<p>I ventured into a fusion of surrealism and digital art, creating a cosmic silhouette that evokes contemplation. This image brings to mind artists like <a href='https://en.wikipedia.org/wiki/Max_Ernst'>Max Ernst</a> and <a href='https://en.wikipedia.org/wiki/Solidarity_(artist)'>Yayoi Kusama</a>, emitting a dreamlike serenity through its rich colors and ethereal design. The overall mood is introspective, suggesting a journey beyond the physical.</p><p>(I used the IP-Style-Adapter with an abstract image from an negative prompt experiment to use as an reference.</p>"
        },
        {
            "image": "public/experiments/ip_adapter_style_3.webp",
            "title": "Dreamlike surreal digital art",
            "text": "<p>I explored the realms of surrealism and digital manipulation in this piece. The imagery evokes the style of <a href='https://en.wikipedia.org/wiki/Sandy_Skoglund'>Sandy Skoglund</a>, merging playful forms with a vibrant color palette. The mood is dreamlike due to the stark contrasts and unexpected composition, inviting contemplation on identity and perception.</p><p>I used the IP-Style-Adapter with an abstract image from an negative prompt experiment to use as an reference.</p>"
        },
        {
            "image": "public/experiments/madefX.webp",
            "title": "Translucent surreal minimalism",
            "text": "<p>In this piece, I explored a blend of minimalism and surrealism through the use of soft, translucent materials. The figure evokes a sense of introspection reminiscent of <a href='https://en.wikipedia.org/wiki/Alberto_Giacometti'>Alberto Giacometti</a>, creating a tranquil mood due to its ethereal colors and smooth contours. The composition invites contemplation on identity and presence.</p><p>Prompt: <br>A statue of a man made of Polycarbonate<br>Steps: 20, Sampler: DPM++ SDE Karras, CFG scale: 8, Seed: 2757207243, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.9, Resize Mode: Crop and Resize, Processor Res: 1024, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.9, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Wildcard prompt: A statue of a man made of __material__, Version: f0.0.12-latest-155-gd81e353d</p>"
        },
        {
            "image": "public/experiments/names_2.webp",
            "title": "Surreal Pop Art Mortality",
            "text": "<p>The Token 'achmed' is strongly associated with 'Achmed the dead terrorist' of Jeff Dunham, an american comedian. It highlights the biases in the training data.</p><p>Prompt: <br>A portrait photo of achmed<br>Steps: 20, Sampler: DPM++ SDE Karras, CFG scale: 7, Seed: 3099379060, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, ControlNet 0: Module: openpose_full, Model: kohya_controllllite xl_openpose_anime_v2 [b0fa10bb], Weight: 0.9, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0.1, Guidance End: 0.8, Pixel Perfect: False, Control Mode: My prompt is more important, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/names_3.webp",
            "title": "Timeless monochrome elegance portrait",
            "text": "<p>The Token 'ronald' is strongly associated with 'Ronald Mac Donald' and makes a clown of everyone.</p><p>Prompt: <br>A portrait photo of ronald<br>Steps: 20, Sampler: DPM++ SDE Karras, CFG scale: 7, Seed: 3099379060, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, ControlNet 0: Module: openpose_full, Model: kohya_controllllite xl_openpose_anime_v2 [b0fa10bb], Weight: 0.9, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0.1, Guidance End: 0.8, Pixel Perfect: False, Control Mode: My prompt is more important, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/popculture_1.webp",
            "title": "Surreal Pop Art Juxtaposition",
            "text": "<p>In this work, I delved into surrealism with a touch of pop art, utilizing strong contrasts and playful elements. The figure's mask invokes thoughts of <a href='https://en.wikipedia.org/wiki/Jeff_Koons'>Jeff Koons</a>, creating a whimsical yet unsettling mood through its unexpected juxtaposition of the formal attire and cartoonish features. The overall design forces a dialogue on identity and perception.</p><p>Prompt: <br>A portrait photo in the style of Danger Mouse, white background, studio photography, looking into the camera<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 4237686742, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, ControlNet 0: Module: openpose_full, Model: thibaud_xl_openpose [c7b9cadd], Weight: 0.85, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.93, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Wildcard prompt: A portrait photo in the style of __pop-culture__, white background, studio photography, looking into the camera, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/popculture_2.webp",
            "title": "Surrealism and Digital Abstraction",
            "text": "<p>I explored the realm of surrealism and digital abstraction in this piece. The imagery evokes the work of <a href='https://en.wikipedia.org/wiki/Jeff_Koons'>Jeff Koons</a> with its glossy surfaces and striking colors. It conveys a sense of alienation due to the stark contrasts and minimalist composition, echoing the themes found in contemporary avant-garde art.</p><p>Prompt: <br>A portrait photo in the style of The Day the Earth Stood Still, white background, studio photography, looking into the camera<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 4237686727, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, ControlNet 0: Module: openpose_full, Model: thibaud_xl_openpose [c7b9cadd], Weight: 0.85, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.93, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Wildcard prompt: A portrait photo in the style of __pop-culture__, white background, studio photography, looking into the camera, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/popculture_3.webp",
            "title": "Whimsical Surrealistic Portrait",
            "text": "<p>In this piece, I played with surrealism and hyper-realistic textures, channeling a whimsical character. The expression captures a mix of confusion and peculiarity, reminiscent of <a href='https://en.wikipedia.org/wiki/Rene_Magritte'>René Magritte</a> with a vibrant palette. The simplicity in backdrop enhances the focus on the subject, evoking an introspective yet playful mood similar to the works of <a href='https://en.wikipedia.org/wiki/Jeff_Koons'>Jeff Koons</a>.</p><p>Prompt: <br>A portrait photo in the style of Earthworm Jim, white background, studio photography, looking into the camera<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 4237686702, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, ControlNet 0: Module: openpose_full, Model: thibaud_xl_openpose [c7b9cadd], Weight: 0.85, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.93, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Wildcard prompt: A portrait photo in the style of __pop-culture__, white background, studio photography, looking into the camera, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/popculture_4.webp",
            "title": "Futuristic Minimalist Figure",
            "text": "<p>In this piece, I explored a blend of futurism and minimalism, utilizing sleek shapes and soft lighting. The figure evokes feelings of contemplation and introspection, reminiscent of <a href='https://en.wikipedia.org/wiki/Marcel_Duchamp'>Marcel Duchamp</a> and his playful yet profound approach. The cool tones contribute to a serene atmosphere, inviting viewers to ponder the interplay between humanity and technology.</p><p>Prompt: <br>A portrait photo in the style of Mega Man, white background, studio photography, looking into the camera<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 4237686708, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, ControlNet 0: Module: openpose_full, Model: thibaud_xl_openpose [c7b9cadd], Weight: 0.85, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.93, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Wildcard prompt: A portrait photo in the style of __pop-culture__, white background, studio photography, looking into the camera, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/preprocessor_1.webp",
            "title": "Haunting Minimalist Monochrome Art",
            "text": "<p>In this piece, I embraced minimalism and high-contrast techniques, focusing on the interplay of light and shadow. The image evokes the essence of <a href='https://en.wikipedia.org/wiki/Edvard_Munch'>Edvard Munch</a> and carries an introspective mood due to its stark composition and monochrome palette. This exploration of identity and emotion feels both haunting and profound.</p><p>Just the Softedge preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/preprocessor_10.webp",
            "title": "High-contrast imagery for mystery",
            "text": "<p>In this piece, I explored high-contrast imagery to evoke a sense of mystery. The strong highlights against the deep shadows resemble the work of <a href='https://en.wikipedia.org/wiki/Francesca_Woodman'>Francesca Woodman</a>. It conveys a contemplative mood due to its stark composition and limited palette, drawing the viewer into the subject's introspection.</p><p>Just the LineArt preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/preprocessor_11.webp",
            "title": "Minimalistic Light and Shadow",
            "text": "<p>In this piece, I explored the interplay of light and shadow using a minimalistic approach. The figure evokes a sense of introspection, reminiscent of <a href='https://en.wikipedia.org/wiki/Alberto_Giacometti'>Alberto Giacometti</a>’s style, capturing a surreal yet haunting mood through its stark contrasts. The simplicity allows viewers to reflect on identity and existence.</p><p>Simply the Depth preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/preprocessor_12.webp",
            "title": "Minimalist Line Art Reflection",
            "text": "<p>I explored minimalism through line art in this piece. The figure’s stark outline evokes a sense of introspection, akin to the works of <a href='https://en.wikipedia.org/wiki/Henri_Matisse'>Henri Matisse</a>. Its monochromatic scheme contributes to a contemplative mood, highlighting the subject's features and inviting viewers to reflect on identity. The simplicity in design accentuates emotional depth and connection.</p><p>Just the Canny preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/preprocessor_2.webp",
            "title": "Abstract Pixelated Mystery Art",
            "text": "<p>In this piece, I explored the realm of pixelation and abstraction, creating a sense of mystery. The image evokes the style of <a href='https://en.wikipedia.org/wiki/Damien_Hirst'>Damien Hirst</a>, aiming for a contemplative mood through muted colors and geometric composition. This technique invites viewers to engage with identity in an unconventional manner.</p><p>Just the T2I Adapter Colorgrid preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/preprocessor_3.webp",
            "title": "Distorted dreamlike abstraction",
            "text": "<p>I explored the realms of distortion and abstraction in this piece. The swirling forms evoke a dreamlike state reminiscent of <a href='https://en.wikipedia.org/wiki/Salvador_Dalí'>Salvador Dalí</a>. The mood here is unsettling due to the unusual composition and muted color palette, inviting the viewer to question perception and reality.</p><p>The Shuffle preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/preprocessor_4.webp",
            "title": "Minimalistic silhouette with stark contrast",
            "text": "<p>I explored minimalism and silhouette in this image. The stark contrast invites introspection, similar to the works of <a href='https://en.wikipedia.org/wiki/Antoni_Tàpies'>Antoni Tàpies</a>, conveying a sense of anonymity and mystery. The muted colors contribute to an overall somber mood, promoting reflection on identity and presence. This approach emphasizes the power of absence in visual storytelling.</p><p>The Segmentation preprocessor for Stable Diffusion as a medium</p>"
        },
        {
            "image": "public/experiments/preprocessor_5.webp",
            "title": "Minimalist Line Art Silhouette",
            "text": "<p>I explored minimalism and line art here, focusing on the interplay of silhouette and simplicity. This piece echoes the work of <a href='https://en.wikipedia.org/wiki/Pablo_Picasso'>Pablo Picasso</a> with its stark, abstract connection to the human form. The mood is introspective, amplified by the high contrast between the figure and the dark background, evoking a sense of quiet contemplation.</p><p>Just the Scribble preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/preprocessor_6.webp",
            "title": "Digital distortion and vibrant art",
            "text": "<p>In this piece, I explored digital distortion and vibrant color palettes. The imagery evokes the work of <a href='https://en.wikipedia.org/wiki/Andy_Warhol'>Andy Warhol</a> with its bold hues and pop art influence. The overall atmosphere feels surreal due to the unconventional composition and blending of forms. This creates an intriguing juxtaposition between the familiar and the abstract.</p><p>Just the Normal Map preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/preprocessor_7.webp",
            "title": "Geometric abstract digital manipulation",
            "text": "<p>I explored geometric abstraction and digital manipulation in this piece. The structure evokes the works of <a href='https://en.wikipedia.org/wiki/Piet_Mondrian'>Piet Mondrian</a>, presenting a sense of balance and order. The use of vibrant lines and dots creates an energetic atmosphere, highlighting a dynamic interplay between chaos and harmony, which conveys a feeling of curiosity and introspection.</p><p>Just the HumanPose preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/preprocessor_8.webp",
            "title": "Digitally abstract gradient exploration",
            "text": "<p>In this piece, I explored the interplay of digital abstraction with soft, ethereal gradients. The work evokes the surreal qualities found in <a href='https://en.wikipedia.org/wiki/James_Turrell'>James Turrell</a>’s installations, offering a contemplative mood through its luminous colors and simplified forms. The overall design invites viewers into a meditative experience, blurring the lines between reality and imagination.</p><p>Another Normal Map preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/preprocessor_9.webp",
            "title": "Abstract minimalism inspired by Miró",
            "text": "<p>In this piece, I explored abstract minimalism using stark lines against a dark background. The composition echoes the works of <a href='https://en.wikipedia.org/wiki/Joan_Mir%C3%B3'>Joan Miró</a>, creating a sense of tension and release. The mood feels contemplative, driven by the interplay of light and space, inviting viewers to reflect on the simplicity of form and the complexity of emotions.</p><p>Just the MLSD preprocessor for Stable Diffusion.</p>"
        },
        {
            "image": "public/experiments/progression_1.webp",
            "title": "Realistic Art with Emotional Depth",
            "text": "<p>In this work, I explored realism with a focus on emotional depth. The intense gaze and intricate details remind me of <a href='https://en.wikipedia.org/wiki/Lucian_Freud'>Lucian Freud</a>, creating a mood of introspection. The subtle color palette and the use of texture enhance the subject's vulnerability, inviting reflection on identity and presence in a complex world.</p><p>Prompt: <br>a young bald man<br>teps: 20, Sampler: DPM++ 2M Karras, CFG scale: 10, Seed: 2270213381, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: openpose_full, Model: kohya_controllllite xl_openpose_anime [7e5349e5], Weight: 1, Resize Mode: Crop and Resize, Low Vram: False, Processor Res: 512, Guidance Start: 0, Guidance End: 1, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Save Detected Map: True, ControlNet 1: Module: lineart_standard (from white bg & black line), Model: t2i-adapter_diffusers_xl_lineart [bae0efef], Weight: 1, Resize Mode: Crop and Resize, Low Vram: False, Processor Res: 512, Guidance Start: 0, Guidance End: 1, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Save Detected Map: True, Version: v1.8.0</p>"
        },
        {
            "image": "public/experiments/progression_2.webp",
            "title": "Isolation Through Minimalist Lighting",
            "text": "<p>In this piece, I utilized a minimalist approach with soft, subtle lighting to evoke a sense of isolation. The composition brings to mind the style of <a href='https://en.wikipedia.org/wiki/Andreas_Gursky'>Andreas Gursky</a>, conveying a contemplative mood through the expansive space and muted colors. The interplay of light and shadow creates a serene yet introspective atmosphere.</p><p>Prompt: <br>a young bald man<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 10, Seed: 2270213381, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: openpose_full, Model: kohya_controllllite xl_openpose_anime [7e5349e5], Weight: 1, Resize Mode: Crop and Resize, Low Vram: False, Processor Res: 512, Guidance Start: 0, Guidance End: 1, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Save Detected Map: True, ControlNet 1: Module: lineart_standard (from white bg & black line), Model: t2i-adapter_diffusers_xl_lineart [bae0efef], Weight: 1, Resize Mode: Crop and Resize, Low Vram: False, Processor Res: 512, Guidance Start: 0, Guidance End: 1, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Save Detected Map: True, Version: v1.8.0</p>"
        },
        {
            "image": "public/experiments/prompt_slang_1.webp",
            "title": "Expressive portrait invoking introspection",
            "text": "<p>I approached this piece using a raw, expressive style that emphasizes the subject's rugged features. The image evokes the emotional depth found in the works of <a href='https://en.wikipedia.org/wiki/Lucian_Freud'>Lucian Freud</a>, featuring a contemplative mood enhanced by muted tones and stark lighting. This composition invites introspection about strength and vulnerability.</p><p>Prompt: <br>a cringe man<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 3421359004, Size: 768x1024, Model hash: aeb7e9e689, Model: juggernautXL_v8Rundiffusion, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.65, Resize Mode: Crop and Resize, Processor Res: 1024, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.8, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/prompt_slang_2.webp",
            "title": "Vulnerability Through Hyper-Realism",
            "text": "<p>In this piece, I explored the theme of vulnerability using hyper-realistic textures and stark lighting. The expression evokes a sense of raw emotion, reminiscent of <a href='https://en.wikipedia.org/wiki/Lucian_Freud'>Lucian Freud</a> in its intensity. The muted tones create a somber atmosphere, emphasizing the subject’s isolation and depth, much like the works of <a href='https://en.wikipedia.org/wiki/Francis_Bacon_(artist)'>Francis Bacon</a>.</p><p>Prompt: <br>a thick man<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 3421359004, Size: 768x1024, Model hash: aeb7e9e689, Model: juggernautXL_v8Rundiffusion, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.65, Resize Mode: Crop and Resize, Processor Res: 1024, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.8, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/prompt_slang_3.webp",
            "title": "Intimate portrait in natural light",
            "text": "<p>I explored the realm of portraiture here, utilizing natural light and a subdued backdrop. This image brings to mind the works of <a href='https://en.wikipedia.org/wiki/Lucian_Freud'>Lucian Freud</a>, evoking a sense of introspection due to its starkness and raw detail. The muted colors and intimate composition create a contemplative atmosphere, inviting viewers to reflect on the subject's emotions.</p><p>Prompt: <br>a fly man<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 3421359004, Size: 768x1024, Model hash: aeb7e9e689, Model: juggernautXL_v8Rundiffusion, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.65, Resize Mode: Crop and Resize, Processor Res: 1024, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.8, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/prompt_slang_4.webp",
            "title": "Intense Realism and Emotion",
            "text": "<p>I'm drawn to the raw emotion captured here, experimenting with realism and a candid approach. This piece echoes the intensity of <a href='https://en.wikipedia.org/wiki/Lucian_Freud'>Lucian Freud</a> and carries a somber mood due to the stark expression and muted color palette. The overall design invites introspection, prompting viewers to connect with the subject's inner world.</p><p>Prompt: <br>a wild man<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 3421359004, Size: 768x1024, Model hash: aeb7e9e689, Model: juggernautXL_v8Rundiffusion, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.65, Resize Mode: Crop and Resize, Processor Res: 1024, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.8, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/randomization_1.webp",
            "title": "Urban decay through mixed media",
            "text": "<p>In this piece, I explored the theme of urban decay through mixed media. The juxtaposition of vibrant colors against the muted background evokes a sense of lost vitality. This style reminds me of <a href='https://en.wikipedia.org/wiki/Banksy'>Banksy</a>, creating a gritty yet hopeful atmosphere through unexpected elements. The overall composition conveys resilience amid chaos.</p><p>Prompt: <br>Z!D8v&Bb4R$mX@G<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 10, Seed: 3788024027, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.85, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.4, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/randomization_2.webp",
            "title": "Minimalist Portrait of Vulnerability",
            "text": "<p>In this piece, I explored the theme of introspection through a minimalist portrait. The muted color palette and stark expression evoke a sense of vulnerability, reminiscent of <a href='https://en.wikipedia.org/wiki/Lucian_Freud'>Lucian Freud</a>. The mood is somber, enhanced by the subtle textures and shadows that invite viewers to contemplate the subject's inner world.</p><p>Prompt: <br>a yDuvg bal$ man<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 10, Seed: 2246935582, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.85, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.4, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/scheduler_1.webp",
            "title": "Exploring light and shadow",
            "text": "<p>In this piece, I explored the interplay of light and shadow to evoke emotion. The composition resonates with the works of <a href='https://en.wikipedia.org/wiki/Richard_Avedon'>Richard Avedon</a>, showcasing an introspective mood through bold contrasts. The cool blue and warm tones create an enigmatic atmosphere, inviting viewers to connect deeply with the subject's expression.</p><p>Prompt: <br>A portrait photo of a young bald man, three quarter view, (beard stubble:0.7), black t-shirt, looking into the camera, shaved, white background, studio photography<br>Negative prompt: blue, overexposed<br>Steps: 21, Sampler: LCM Karras, CFG scale: 8, Seed: 3319583382, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.6, Resize Mode: Crop and Resize, Processor Res: 1336, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0.22, Guidance End: 0.48, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/scheduler_2.webp",
            "title": "Light and shadow play",
            "text": "<p>In this work, I played with light and shadow, creating a dramatic contrast that highlights the subject's features. The image suggests the introspective quality reminiscent of <a href='https://en.wikipedia.org/wiki/Sandro_Botticelli'>Sandro Botticelli</a>, evoking a contemplative mood through its color palette and composition. This piece captures a blend of realism and emotional depth, inviting viewers to ponder the narrative behind the gaze.</p><p>Prompt: <br>A portrait photo of a young bald man, three quarter view, (beard stubble:0.7), black t-shirt, looking into the camera, shaved, white background, studio photography<br>Negative prompt: blue, overexposed<br>Steps: 21, Sampler: DPM++ 3M SDE Exponential, CFG scale: 8, Seed: 3319583382, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.6, Resize Mode: Crop and Resize, Processor Res: 1336, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0.22, Guidance End: 0.48, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_1.webp",
            "title": "Contemplative blend of abstraction",
            "text": "<p>In this piece, I explored a blend of abstraction and realism, using a soft palette and fluid textures. The composition evokes a sense of introspection, reminiscent of the works by <a href='https://en.wikipedia.org/wiki/Lucian_Freud'>Lucian Freud</a>. The overall mood is contemplative, reinforced by the organic forms and muted colors that guide the viewer's eye throughout the image.</p><p>Prompt: <br>Steps: 40, Sampler: DPM++ 2M Karras, CFG scale: 5, Seed: 3735446169, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_10.webp",
            "title": "Tranquil nature painting",
            "text": "<p>I explored here with impressionistic techniques and a soft color palette. This piece evokes a feeling of tranquility, reminiscent of the works by <a href='https://en.wikipedia.org/wiki/John_Constable'>John Constable</a>. The light brushwork and gentle hues create a serene atmosphere, inviting viewers to reflect on the delicate beauty of nature.</p><p>Prompt: <br>Steps: 40, Sampler: DPM++ 2M Karras, CFG scale: 5, Seed: 4005378757, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_11.webp",
            "title": "Abstract organic composition with warmth",
            "text": "<p>In this piece, I explored a blend of abstract and organic forms using layering and texture. The composition evokes the work of <a href='https://en.wikipedia.org/wiki/Mark_Rothko'>Mark Rothko</a>, reflecting a serene yet intricate atmosphere. The colors radiate warmth, suggesting a peaceful moment in nature. Overall, the image invites contemplation through its interplay of light and shadow.</p><p>Prompt: <br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 2118017378, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_12.webp",
            "title": "Abstract collage evoking nostalgia",
            "text": "<p>In this piece, I explored a blend of abstract expressionism and collage techniques. The layered textures and muted colors evoke a sense of nostalgia, reminiscent of <a href='https://en.wikipedia.org/wiki/Robert_Rauschenberg'>Robert Rauschenberg</a>'s works. The overall ambiance feels contemplative, with a hint of mystery due to its fragmented nature and obscure lettering.</p><p>Prompt: <br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 2118017376, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_2.webp",
            "title": "Decay and renewal in art",
            "text": "<p>In this piece, I explored a blend of abstract realism and environmental art. The imagery evokes a sense of forgotten utility, reminiscent of <a href='https://en.wikipedia.org/wiki/Robert_Rauschenberg'>Robert Rauschenberg</a>. The muted colors and fragmented forms create a melancholic mood, prompting reflection on nature's reclamation of human objects. The composition emphasizes the intersection of decay and renewal.</p><p>Prompt: <br>Steps: 40, Sampler: DPM++ 2M Karras, CFG scale: 5, Seed: 3735446168, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_3.webp",
            "title": "Serene minimalist exploration",
            "text": "<p>In this piece, I explored the interplay of light and shadow using a minimalist approach. The composition reflects the works of <a href='https://en.wikipedia.org/wiki/Mark_Rothko'>Mark Rothko</a>, invoking a serene atmosphere due to the soft gradients and muted tones. The overall design evokes a sense of calm and introspection, inviting the viewer to linger in contemplation.</p><p>Prompt: <br>Steps: 40, Sampler: DPM++ 2M Karras, CFG scale: 5, Seed: 3735446167, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_4.webp",
            "title": "Abstract realism in solitude",
            "text": "<p>In this piece, I explored a blend of abstraction and realism using textured layers. The depiction of the horse evokes the emotive style of <a href='https://en.wikipedia.org/wiki/Franz_Kline'>Franz Kline</a>, creating a sense of solitude through muted colors and sparse composition. The essence here is one of quiet contemplation, inviting viewers to interpret the space between form and emptiness.</p><p>Prompt: <br>Steps: 40, Sampler: DPM++ 2M Karras, CFG scale: 5, Seed: 21021986, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_5.webp",
            "title": "Modern minimalist fashion photography",
            "text": "<p>In this piece, I explored a blend of modern fashion photography and minimalism. The soft colors and flowing shapes evoke a sense of elegance and tranquility reminiscent of artists like <a href='https://en.wikipedia.org/wiki/Piet_Mondrian'>Piet Mondrian</a>. The mood is serene and introspective, enhanced by the soft draping and gentle light. This fusion creates a striking yet harmonious composition.</p><p>Prompt: <br>Steps: 40, Sampler: DPM++ 2M Karras, CFG scale: -3, Seed: 1, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_6.webp",
            "title": "Impressionistic digital manipulation artwork",
            "text": "<p>I played with impressionistic techniques and digital manipulation in this piece. The image evokes the fluidity found in the works of <a href='https://en.wikipedia.org/wiki/Camille_Pissarro'>Camille Pissarro</a>, bringing a dreamy quality. The muted colors and textured layers contribute to a contemplative atmosphere, reflecting themes of identity and self-expression in an abstract manner.</p><p>Prompt: <br>Steps: 40, Sampler: DPM++ 2M Karras, CFG scale: -1, Seed: 3, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_7.webp",
            "title": "Soft Focus Ethereal Contemplation",
            "text": "<p>In this piece, I explored the technique of soft focus and ethereal color palettes. The image embodies a contemplative mood, similar to the works of <a href='https://en.wikipedia.org/wiki/John_Singer_Sargent'>John Singer Sargent</a>. The blurred details and gentle tones evoke a sense of introspection, inviting viewers to connect emotionally with the subject's expression.</p><p>Prompt: <br>Steps: 40, Sampler: DPM++ 2M Karras, CFG scale: 5, Seed: 3, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_8.webp",
            "title": "Impressionistic abstraction with earth tones",
            "text": "<p>In this piece, I explored a blend of impressionism and abstraction, using a palette of muted earth tones. The composition echoes the atmospheric landscapes of <a href='https://en.wikipedia.org/wiki/Caspar_David_Friedrich'>Caspar David Friedrich</a>, creating a serene mood that invites contemplation. The soft textures and delicate transitions evoke a sense of nostalgia, reflecting nature's quiet beauty.</p><p>Prompt: <br>Steps: 40, Sampler: DPM++ 2M Karras, CFG scale: 5, Seed: 2, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/seed_empty_prompt_9.webp",
            "title": "Abstract texture inspired by Bacon",
            "text": "<p>In this piece, I played with abstraction and texture to convey a sense of fluidity. The layers of color and form remind me of <a href='https://en.wikipedia.org/wiki/Francis_Bacon_(artist)'>Francis Bacon</a>, evoking a mood of introspection due to the contrast between dark and light areas. The composition challenges perception, creating a dynamic experience for the viewer.</p><p>Prompt: <br>Steps: 40, Sampler: DPM++ 2M Karras, CFG scale: 5, Seed: 1, Size: 768x1024, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/size_1.webp",
            "title": "Fluid Abstraction with Vibrant Colors",
            "text": "<p>In this piece, I experimented with fluid abstraction and vibrant color interplay. The image evokes the style of <a href='https://en.wikipedia.org/wiki/Anish_Kapoor'>Anish Kapoor</a>, featuring a dynamic mood due to its undulating forms and bold palette. The overall design creates a sense of movement, inviting the viewer into a vibrant visual experience.</p><p>Prompt: <br>A three quarter portrait photo of a young bald man, looking into the camera, black t-shirt, shaved, white background, studio photographyNegative prompt: glasses<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 1599218781, Size: 312x256, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Seed resize from: 1010x1010, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/size_2.webp",
            "title": "Warhol-inspired Digital Portraiture",
            "text": "<p>I explored a blend of digital manipulation and portraiture here. The image is reminiscent of the works of <a href='https://en.wikipedia.org/wiki/Andy_Warhol'>Andy Warhol</a>, capturing a vibrant yet unsettling mood through bold colors and repetitive composition. Each layer evokes a sense of introspection juxtaposed with modern aesthetics, inviting viewers to reflect on individuality and perception.</p><p>Prompt: <br>A three quarter portrait photo of a young bald man, looking into the camera, black t-shirt, shaved, white background, studio photographyNegative prompt: glasses<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 1599218781, Size: 256x594, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Seed resize from: 1010x1010, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/size_3.webp",
            "title": "Abstract silhouette exploring identity",
            "text": "<p>I explored digital abstraction and silhouette techniques in this piece. The image reflects the style of <a href='https://en.wikipedia.org/wiki/Manfred_Mohr'>Manfred Mohr</a>, evoking a futuristic mood through its layered contrasts and ethereal shapes. The interplay of light and shadow enhances the overall design, drawing the viewer into a contemplative state about identity and presence.</p><p>Prompt: <br>A three quarter portrait photo of a young bald man, looking into the camera, black t-shirt, shaved, white background, studio photographyNegative prompt: glasses<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 1599218781, Size: 256x542, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Seed resize from: 1010x1010, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/size_4.webp",
            "title": "Digital layered photography exploration",
            "text": "<p>In this piece, I explored digital manipulation and layered photography. The imagery evokes the works of <a href='https://en.wikipedia.org/wiki/David_Hockney'>David Hockney</a>, creating a surreal atmosphere through vibrant colors and intriguing compositions. The mood is introspective, enhanced by the juxtaposition of faces, which invites viewers to contemplate identity and perception.</p><p>Prompt: <br>A three quarter portrait photo of a young bald man, looking into the camera, black t-shirt, shaved, white background, studio photographyNegative prompt: glasses<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 1599218781, Size: 928x256, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Seed resize from: 1010x1010, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/size_5.webp",
            "title": "Interplay of light and shadow",
            "text": "<p>In this piece, I explored the interplay of light and shadow using a **digital layering technique**. The soft focus evokes a sense of mystery, similar to the works of <a href='https://en.wikipedia.org/wiki/Andreas_Gursky'>Andreas Gursky</a>, and conveys an introspective mood through subdued colors. The composition invites viewers to contemplate identity and presence.</p><p>Prompt: <br>A three quarter portrait photo of a young bald man, looking into the camera, black t-shirt, shaved, white background, studio photographyNegative prompt: glasses<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 1599218781, Size: 452x256, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Seed resize from: 1010x1010, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/size_6.webp",
            "title": "Duality in Digital Painting",
            "text": "<p>In this piece, I explored the concept of duality using a digital painting technique. The blurred figure contrasts with the clear portrait, reminiscent of the works of <a href='https://en.wikipedia.org/wiki/Francis_Bacon_(artist)'>Francis Bacon</a>. The mood is introspective and enigmatic, enhanced by the soft color palette and minimalistic composition.</p><p>Prompt: <br>A three quarter portrait photo of a young bald man, looking into the camera, black t-shirt, shaved, white background, studio photographyNegative prompt: glasses<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 1599218781, Size: 1908x1264, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Seed resize from: 1010x1010, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/size_7.webp",
            "title": "Surrealism and Disembodiment Theme",
            "text": "<p>In this piece, I explored surrealism and minimalism, focusing on the disembodiment theme. The image evokes a sense of introspection and alienation, reminiscent of the works of <a href='https://en.wikipedia.org/wiki/Francis_Bacon'>Francis Bacon</a>. The muted colors contribute to an overall feeling of unease, enhancing the viewer's connection to the subject's isolation.</p><p>Prompt: <br>A three quarter portrait photo of a young bald man, looking into the camera, black t-shirt, shaved, white background, studio photographyNegative prompt: glasses<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 1599218781, Size: 1908x1432, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Seed resize from: 1010x1010, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/size_8.webp",
            "title": "Surrealistic exploration of identity",
            "text": "<p>In this piece, I explored the elements of surrealism and abstraction, delving into identity and duality. The imagery evokes a sense of introspection, reminiscent of <a href='https://en.wikipedia.org/wiki/Frida_Kahlo'>Frida Kahlo</a> and her exploration of self. The muted tones and fragmented forms create a contemplative mood, highlighting the complexities of human emotion and perception.</p><p>Prompt: <br>A three quarter portrait photo of a young bald man, looking into the camera, black t-shirt, shaved, white background, studio photographyNegative prompt: glasses<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 1599218781, Size: 1501x1501, Model hash: 7271c644c1, Model: copaxTimelessxlSDXL1_10, Seed resize from: 1010x1010, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/steps1.webp",
            "title": "Abstract exploration of light",
            "text": "<p>In this artwork, I explored the realms of abstraction using soft, blurred lines and a warm color palette. The piece evokes a sense of mystery, reminiscent of the works of <a href='https://en.wikipedia.org/wiki/Mark_Rothko'>Mark Rothko</a>. The overall atmosphere feels introspective, enhanced by the subtle interplay of light and shadow throughout the composition.</p><p>Prompt: <br>A portrait photo of a young bald man, three quarter view, (beard stubble:0.7), black t-shirt, looking into the camera, shaved, white background, studio photography<br>Negative prompt: blue, overexposed<br>Steps: 3, Sampler: Euler a, CFG scale: 8, Seed: 3319583382, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.6, Resize Mode: Crop and Resize, Processor Res: 1336, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0.22, Guidance End: 0.48, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/steps2.webp",
            "title": "Dreamlike light and shadow",
            "text": "<p>I explored the interplay of light and shadow here, using a soft focus technique to evoke a dreamlike atmosphere. This piece echoes the works of <a href='https://en.wikipedia.org/wiki/Andreas_Gursky'>Andreas Gursky</a>, conveying a sense of introspection through muted tones and abstract forms. The overall mood hints at emotional depth, inviting contemplation on identity and presence.</p><p>Prompt: <br>A portrait photo of a young bald man, three quarter view, (beard stubble:0.7), black t-shirt, looking into the camera, shaved, white background, studio photography<br>Negative prompt: blue, overexposed<br>Steps: 6, Sampler: Euler a, CFG scale: 8, Seed: 3319583382, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.6, Resize Mode: Crop and Resize, Processor Res: 1336, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0.22, Guidance End: 0.48, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/steps3.webp",
            "title": "Vibrant color blending art",
            "text": "<p>In this piece, I explored blending techniques with vibrant, contrasting colors. The image evokes the essence of <a href='https://en.wikipedia.org/wiki/Andreas_Gursky'>Andreas Gursky</a>, merging abstraction and portraiture to achieve a contemplative mood. The soft focus and bold color application create an intriguing visual experience, inviting viewers to contemplate identity and perception.</p><p>Prompt: <br>A portrait photo of a young bald man, three quarter view, (beard stubble:0.7), black t-shirt, looking into the camera, shaved, white background, studio photography<br>Negative prompt: blue, overexposed<br>Steps: 8, Sampler: Euler a, CFG scale: 8, Seed: 3319583382, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.6, Resize Mode: Crop and Resize, Processor Res: 1336, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0.22, Guidance End: 0.48, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/steps4.webp",
            "title": "Colorful minimalist portraiture inspiration",
            "text": "<p>In this piece, I played with vibrant color contrasts and minimalist portraiture. The warm reds juxtaposed with cool greens create a striking tension, similar to the works of <a href='https://en.wikipedia.org/wiki/Alex_Katz'>Alex Katz</a>. This composition evokes a contemplative atmosphere, accentuated by the clean lines and subtle expressions, reminiscent of contemporary portrait artists exploring human emotion.</p><p>Prompt: <br>A portrait photo of a young bald man, three quarter view, (beard stubble:0.7), black t-shirt, looking into the camera, shaved, white background, studio photography<br>Negative prompt: blue, overexposed<br>Steps: 9, Sampler: Euler a, CFG scale: 8, Seed: 3319583382, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.6, Resize Mode: Crop and Resize, Processor Res: 1336, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0.22, Guidance End: 0.48, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/steps5.webp",
            "title": "Realism and minimalism blend",
            "text": "<p>In this piece, I explored a blend of realism and modern minimalism, employing soft gradients and striking color contrasts. The image reflects the work of <a href='https://en.wikipedia.org/wiki/Lucian_Freud'>Lucian Freud</a> while conveying a contemplative mood due to the interplay of light and shadow on the subject's face. The simplicity of the background amplifies the subject's emotional depth.</p><p>Prompt: <br>A portrait photo of a young bald man, three quarter view, (beard stubble:0.7), black t-shirt, looking into the camera, shaved, white background, studio photography<br>Negative prompt: blue, overexposed<br>Steps: 13, Sampler: Euler a, CFG scale: 8, Seed: 3319583382, Size: 768x1024, Model hash: df64bcef34, Model: copaxTimelessxlSDXL1_v5, ControlNet 0: Module: softedge_pidinet, Model: sargezt_xl_softedge [b6f7415b], Weight: 0.6, Resize Mode: Crop and Resize, Processor Res: 1336, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0.22, Guidance End: 0.48, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/token_artificialintelligence.webp",
            "title": "Futuristic reflections on technology",
            "text": "<p>In this piece, I explored the intersection of technology and humanity using a sleek, futuristic style. The reflective surfaces and intricate details evoke the work of <a href='https://en.wikipedia.org/wiki/Hiroshi_Ishiguro'>Hiroshi Ishiguro</a>, highlighting a mood of contemplation about artificial intelligence. The contrast of light and dark emphasizes both form and emotion, making it thought-provoking and visually engaging.</p><p>Prompt: <br>artificialintelligence<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 1053665971, Size: 512x768, Model hash: d615bf3288, Model: photon_v1, Denoising strength: 0.4, Hires upscale: 1.8, Hires upscaler: 4xUltrasharp_4xUltrasharpV10, VAE Encoder: TAESD, Mask blur: 4, Inpaint area: Only masked, Masked area padding: 32, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/token_bloo.webp",
            "title": "Surrealistic Blue Palette",
            "text": "<p>In this piece, I explored a cool color palette using a surrealistic approach. The imagery evokes the style of <a href='https://en.wikipedia.org/wiki/Yayoi_Kusama'>Yayoi Kusama</a>, capturing a futuristic mood through its striking use of blue tones. The composition enhances the emotional depth, creating a sense of introspection and uniqueness.</p><p>Prompt: <br>bloo <br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 4206192140, Size: 512x768, Model hash: d615bf3288, Model: photon_v1, Denoising strength: 0.4, ControlNet 0: Module: openpose, Model: control_v11p_sd15_openpose [cab727d4], Weight: 1, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.35, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Hires upscale: 1.5, Hires upscaler: 4xUltrasharp_4xUltrasharpV10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/token_comparison.webp",
            "title": "Contrasting Time and Identity",
            "text": "<p>I explored contrasts in time and identity through a split image technique. The juxtaposition of the child and the adult conveys a sense of nostalgia and evolution. This piece echoes the works of <a href='https://en.wikipedia.org/wiki/Chuck_Close'>Chuck Close</a>, capturing intricate details and a surreal quality. The mood is reflective, accentuated by the stark black and white against vibrant colors.</p><p>Prompt: <br>transformationtuesday<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 2320914742, Size: 512x768, Model hash: d615bf3288, Model: photon_v1, Seed resize from: 512x512, Denoising strength: 0.4, Hires upscale: 1.8, Hires upscaler: 4xUltrasharp_4xUltrasharpV10, Mask blur: 4, Inpaint area: Only masked, Masked area padding: 32, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/token_ibb.webp",
            "title": "Digital anthropomorphic character design",
            "text": "<p>I explored a blend of digital illustration and character design, creating an anthropomorphic figure with softened features. This piece echoes the styles of <a href='https://en.wikipedia.org/wiki/Katsuhiro_Otomo'>Katsuhiro Otomo</a> and <a href='https://en.wikipedia.org/wiki/Takashi_Murakami'>Takashi Murakami</a>. The image conveys a whimsical yet contemplative mood through its muted tones and playful expression.</p><p>Prompt: <br>po, grey background<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 2150283690, Size: 512x768, Model hash: d615bf3288, Model: photon_v1, Denoising strength: 0.55, ControlNet 0: Module: openpose, Model: control_v11p_sd15_openpose [cab727d4], Weight: 1, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.35, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Hires upscale: 1.5, Hires upscaler: 4xUltrasharp_4xUltrasharpV10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/token_marsha.webp",
            "title": "Surreal Pop Art Portrait",
            "text": "<p>In this piece, I explored a blend of surrealism and pop art, focusing on exaggerated facial features and playful typography. The stylized portrait evokes the works of <a href='https://en.wikipedia.org/wiki/Saul_Bass'>Saul Bass</a>, conveying a whimsical yet unsettling mood through the contrast of warm earth tones and bold lines. The combination of classic elegance with a touch of absurdity creates intrigue.</p><p>Prompt: <br>thinkbigsundaywithmarsha<br>Steps: 20, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 675945003, Size: 512x768, Model hash: d615bf3288, Model: photon_v1, Denoising strength: 0.4, Hires upscale: 1.8, Hires upscaler: 4xUltrasharp_4xUltrasharpV10, Mask blur: 4, Inpaint area: Only masked, Masked area padding: 32, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/token_nom.webp",
            "title": "Vivid surrealism with bold colors",
            "text": "<p>I'm captivated by the surrealism in this piece, using bold colors and exaggerated features to create an unsettling yet playful atmosphere. The composition evokes a sense of whimsy reminiscent of <a href='https://en.wikipedia.org/wiki/Dali'>Salvador Dalí</a>, while the vivid contrasts and absurd elements draw parallels to the works of <a href='https://en.wikipedia.org/wiki/Yayoi_Kusama'>Yayoi Kusama</a>, creating a dynamic, thought-provoking mood.</p><p>Prompt: <br>nom<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 1438391984, Size: 512x768, Model hash: d615bf3288, Model: photon_v1, Denoising strength: 0.4, ControlNet 0: Module: openpose, Model: control_v11p_sd15_openpose [cab727d4], Weight: 1, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.35, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Hires upscale: 1.5, Hires upscaler: 4xUltrasharp_4xUltrasharpV10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/token_ood.webp",
            "title": "Surrealistic 3D Francis Bacon",
            "text": "<p>I explored surrealism and 3D modeling techniques in this piece. The imagery evokes a sense of intrigue and discomfort, reminiscent of the works of <a href='https://en.wikipedia.org/wiki/Francis_Bacon'>Francis Bacon</a>. The muted color palette and unusual forms contribute to an unsettling atmosphere, inviting viewers to ponder the nature of identity and transformation.</p><p>Prompt: <br>ood, grey background, soft ambient light<br>Negative prompt: monochrome<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 2636158606, Size: 512x768, Model hash: d615bf3288, Model: photon_v1, Denoising strength: 0.55, ControlNet 0: Module: dw_openpose_full, Model: control_v11p_sd15_openpose [cab727d4], Weight: 1, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 1, Pixel Perfect: False, Control Mode: Balanced, Hr Option: Both, Hires upscale: 1.5, Hires upscaler: 4xUltrasharp_4xUltrasharpV10, Version: f0.0.17v1.8.0rc-latest-269-gef35383b</p>"
        },
        {
            "image": "public/experiments/weight1.webp",
            "title": "Surrealistic digital sculpture exploration",
            "text": "<p>I delved into the realms of digital sculpture using a surrealistic approach. This piece echoes the styles of <a href='https://en.wikipedia.org/wiki/Alberto_Giacometti'>Alberto Giacometti</a> and <a href='https://en.wikipedia.org/wiki/Francis_Bacon'>Francis Bacon</a>, presenting an unsettling yet intriguing mood through its distorted features and striking colors. The composition invites viewers to explore themes of identity and perception.</p><p>Prompt: <br>A portrait photo of a young (bald:1.8) man, looking into the camera, black t-shirt, shaved, white background, studio photography<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 3817350396, Size: 600x800, Model hash: 51f6fff508, Model: analogDiffusion_10Safetensors, ControlNet 0: Module: openpose_full, Model: control_v11p_sd15_openpose [cab727d4], Weight: 1, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.93, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/weight2.webp",
            "title": "Digital surrealism with Tàpies influence",
            "text": "<p>I explored the interplay of surrealism and digital sculpture here, using techniques that blend traditional forms with futuristic elements. This piece echoes the work of <a href='https://en.wikipedia.org/wiki/Antoni_Tàpies'>Antoni Tàpies</a> and carries a haunting mood due to its contrast between organic shapes and artificial textures, creating an unsettling yet intriguing visual experience.</p><p>Prompt: <br>A portrait photo of a young (bald:1.9) man, looking into the camera, black t-shirt, shaved, white background, studio photography<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 3817350396, Size: 600x800, Model hash: 51f6fff508, Model: analogDiffusion_10Safetensors, ControlNet 0: Module: openpose_full, Model: control_v11p_sd15_openpose [cab727d4], Weight: 1, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.93, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        },
        {
            "image": "public/experiments/weight3.webp",
            "title": "Surrealistic digital art fusion",
            "text": "<p>In this piece, I explored the realms of surrealism and digital manipulation. The figure embodies a fusion of human and abstract elements, evoking thoughts of <a href='https://en.wikipedia.org/wiki/H.R._Giger'>H.R. Giger</a>. The artwork carries an unsettling mood, amplified by the contrasting colors and chaotic composition, reminiscent of <a href='https://en.wikipedia.org/wiki/Francis_Bacon_(artist)'>Francis Bacon</a>.</p><p>Prompt: <br>A portrait photo of a (young:2.4) bald man, looking into the camera, black t-shirt, shaved, white background, studio photography<br>Steps: 20, Sampler: Euler a, CFG scale: 7, Seed: 3817350396, Size: 600x800, Model hash: 51f6fff508, Model: analogDiffusion_10Safetensors, ControlNet 0: Module: openpose_full, Model: control_v11p_sd15_openpose [cab727d4], Weight: 1, Resize Mode: Crop and Resize, Processor Res: 512, Threshold A: 0.5, Threshold B: 0.5, Guidance Start: 0, Guidance End: 0.93, Pixel Perfect: False, Control Mode: ControlNet is more important, Hr Option: Both, Version: f0.0.14v1.8.0rc-latest-184-g43c9e3b5</p>"
        }
    ]
}